#!/usr/bin/python 
# -*- coding: utf-8 -*-

from  shikigami import *
from collections import deque
mode=0 #mode:0单局输出模式，其他正数即重复多次给出胜率

class animation():
    def __init__(self):
        self.atk=0
        self.atkf=None
        self.atkt=None
        
        self.heal=0
        self.healf=None
        self.healt=None
        
        self.action=None
        self.turn=None
        
        self.hpChange=[]


###########################式神初始化############
#参数里面各变量名都是用中文写的，应该大多能理解，对不好理解的解释见第一个
#井号“#”表示注释
#################################################
if __name__=='__main__':
    r={}
    b={}
    r[1]=山风({ #这里要改为严格的对应式神的官方的名字，比如酒吞童子不能改为酒吞
        'id':1,#站位的参数，不理解就不要改
        '名字':'山风', #相当于是你给式神取的名字，就像你可以给你的妖刀取名胖次姬一样
        '速度':108,    
        '位置':0,
        '队伍':0,      #0表示红队，1表示蓝队。不理解就不要改
        '生命':11460,  
        '攻击':2669,
        '防御':439,
        '暴击':0.5,   #注意是用小数表示的，而不是百分数，59%暴击这里填0.59，而非59
        '暴击伤害':1.50,
        '效果命中':1.50,
        '效果抵抗':0.00,
        '御魂':'招财猫'   #用引号引起来，引号里面是御魂的官方的名字，比如日女巳时不要写日女
        })
    r[2]=兵俑({
        'id':2,
        '名字':'兵俑',
        '速度':119,
        '位置':0,
        '队伍':0,
        '生命':10254,
        '攻击':2412,
        '防御':397,
        '暴击':0,
        '暴击伤害':1.50,
        '效果命中':0.00,
        '效果抵抗':0.00,
        '御魂':'破势'
        })
    r[3]=玉藻前({
        'id':3,
        '名字':'玉藻前',
        '速度':130,
        '位置':0,
        '队伍':0,
        '生命':10254,
        '攻击':2412,
        '防御':397,
        '暴击':0.2,
        '暴击伤害':1.50,
        '效果命中':0.00,
        '效果抵抗':0.00,
        '御魂':'招财猫'
        })

    r[4]=匣中少女({
        'id':4,
        '名字':'匣中少女',
        '速度':100,
        '位置':0,
        '队伍':0,
        '生命':110254,
        '攻击':2412,
        '防御':397,
        '暴击':1,
        '暴击伤害':1.50,
        '效果命中':0.00,
        '效果抵抗':0.00,
        '御魂':'返魂香'
        })

    r[5]=雪童子({
        'id':5,
        '名字':'雪童子',
        '速度':127,
        '位置':0,
        '队伍':0,
        '生命':11383,
        '攻击':2385,
        '防御':490,
        '暴击':1.00,
        '暴击伤害':1.50,
        '效果命中':0.40,
        '效果抵抗':0.00,
        '御魂':'招财猫'
        })

    b[1]=般若({
        'id':6,
        '名字':'般若',
        '速度':111,
        '位置':0,
        '队伍':1,
        '生命':10026,
        '攻击':3270,
        '防御':397,
        '暴击':0.50,
        '暴击伤害':1.50,
        '效果命中':10.00,
        '效果抵抗':0.00,
        '御魂':'伤魂鸟'
        })

    b[2]=大天狗({
        'id':7,
        '名字':'大天狗',
        '速度':112,
        '位置':0,
        '队伍':1,
        '生命':10026,
        '攻击':3136,
        '防御':419,
        '暴击':1,
        '暴击伤害':1.50,
        '效果命中':0.00,
        '效果抵抗':0.00,
        '御魂':'针女'
        })
    b[3]=奴良陆生({
        'id':8,
        '名字':'陆生',
        '速度':101,
        '位置':0,
        '队伍':1,
        '生命':10254,
        '攻击':2412,
        '防御':397,
        '暴击':10,
        '暴击伤害':1.50,
        '效果命中':0.00,
        '效果抵抗':0.00,
        '御魂':'招财猫'
        })
    b[4]=辉夜姬({
        'id':9,
        '名字':'辉夜姬',
        '速度':113,
        '位置':0,
        '队伍':1,
        '生命':10254,
        '攻击':2412,
        '防御':397,
        '暴击':0,
        '暴击伤害':1.50,
        '效果命中':10.00,
        '效果抵抗':0.00,
        '御魂':'招财猫'
        })
    b[5]=惠比寿({
        'id':10,
        '名字':'惠比寿',
        '速度':101,
        '位置':0,
        '队伍':1,
        '生命':10254,
        '攻击':2412,
        '防御':397,
        '暴击':0,
        '暴击伤害':1.50,
        '效果命中':0.00,
        '效果抵抗':0.00,
        '御魂':'招财猫'
        })


def main(mode,r,b,rwins=[0],debug=0,animation=None,data=None):
#############################后面的不要乱动了############################
    g={}
    g[0]=裁判旗()

#行动条的初始化

    action=[b[1],b[2],b[3],b[4],b[5],r[1],r[2],r[3],r[4],r[5],g[0]]
    action.sort(key=lambda x:(x.sp,-x.id))

#设立data是为了后面能够更容易传参，利用了python传字典参数时浅拷贝，变相使得变量全局化，同时使得调全局变量更加统一有条理。
    if not data:
        data={'units':[r[1],r[2],r[3],r[4],r[5],b[1],b[2],b[3],b[4],b[5]],
              'uands':[r[1],r[2],r[3],r[4],r[5],b[1],b[2],b[3],b[4],b[5]],
              'teams':[r,b],
              'action':action,
              'win':0,
              'mode':mode,
              'orb':[4,4],
              'getOrb':[3,3],
              'orbPo':[0,0],
              'swords':0,
              'extra':[],
              '反击':[],
              'summons':[None,None],
              'summonsSpecial':[None,None,None,None,None,None,None,None,None,None],
              'ids':10,
              'log':[],
              'debug':debug,
              'animation':animation,
              }
    data['units'].sort(key=lambda x:x.id)

    rate=2.42
    
    for unit in data['units']:
        unit.maxhp*=rate
        unit.maxhp0*=rate
        unit.hp*=rate

#游戏开始
    gameStartCheck(data)
    
    cyc=0
    
#主循环
    while 1:
        cyc+=1
        if len(data['log'])>=10000:
            return 2-data['win'],data['log']
        newTurn(data)
        
        #胜利判定
        if data['win']!=0:
            if mode==0:
                my_print(data,"%d队胜利"%data['win'])
            break


    return 2-data['win'],data['log']



##############下面是主程序######################################
if __name__=='__main__':        
    rwins=[0] #计数红方胜利次数的参数
    if mode==0:
        win,log=main(0,r,b)
        print('\n'.join(log))
    elif mode>0:
        for i in range(mode):
            main(mode,r,b,rwins)
        print("1队胜率：%.2f%%"%(rwins[0]/mode*100))
    else:
        main(-1)

    input('\n回车键退出')
